app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    @todos = Todo.all

SELECT "todos".* FROM "todos" WHERE "todos"."current_status" = $1  [["current_status", "pending"]]
SELECT "todos".* FROM "todos"
---
  def filter
    has_no_filter = params[:status_filter].empty?
    @todos = unless has_no_filter
      Todo.where(current_status: filter_params)
    else
      Todo.all

INSERT INTO "todos" ("title", "description", "due_date", "current_status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "description" = $1, "current_status" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["description", "test"], ["current_status", "pending"], ["updated_at", "2024-05-07 18:41:12.021682"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 2]]
---
  def destroy
    @todo.destroy!

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
    def set_todo
      @todo = Todo.find(params[:id])